13/data/attachments/da200fcbdbe5e7ad.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:nif="niffler-userdata">
    <soapenv:Header/>
    <soapenv:Body>
        <nif:acceptInvitationRequest>
            <nif:username>soap_friends_bdf95f31-4736-4629-b2cb-7d0a6725ca01</nif:username>
            <nif:friendToBeAdded>James_program_Friend_40145_5</nif:friendToBeAdded>
        </nif:acceptInvitationRequest>
    </soapenv:Body>
</soapenv:Envelope>